# 데이터 결합 및 요약
### 데이터 결합
#### 데이터 붙이기

In [2]:
import pandas as pd
obj1={'student_id':['s1','s2','s3','s4','s5','s6'],
      'score':[55,90,85,71,63,99]}
df1=pd.DataFrame(obj1)
print(df1)

  student_id  score
0         s1     55
1         s2     90
2         s3     85
3         s4     71
4         s5     63
5         s6     99

In [3]:
obj2={'student_id':['t1','t2','t3','t4','t5','t6'],
      'score':[65,99,87,75,57,88]}
df2=pd.DataFrame(obj2)
print(df2)

  student_id  score
0         t1     65
1         t2     99
2         t3     87
3         t4     75
4         t5     57
5         t6     88

In [4]:
# pandas.concat()
# 두데이터 프레임을 행을 기준으로 붙임
pd.concat([df1,df2])

  student_id  score
0         s1     55
1         s2     90
2         s3     85
3         s4     71
4         s5     63
5         s6     99
0         t1     65
1         t2     99
2         t3     87
3         t4     75
4         t5     57
5         t6     88

In [5]:
# 두 데이터 프레임을 열을 기준으로 붙임
pd.concat([df1,df2],axis=1)

  student_id  score student_id  score
0         s1     55         t1     65
1         s2     90         t2     99
2         s3     85         t3     87
3         s4     71         t4     75
4         s5     63         t5     57
5         s6     99         t6     88

### 데이터 병합

In [6]:
# 데이터 프레임 1 생성
obj1={'student_id':['s3','s4','s5','s6'],
      'stat_core':[85,71,63,99]}
df1=pd.DataFrame(obj1)
print(df1)

  student_id  stat_core
0         s3         85
1         s4         71
2         s5         63
3         s6         99

In [7]:
# 데이터프레임2 생성
obj2={'student_id':['s1','s2','s3','s4'],
      'stat_core':[65,99,87,75]}
df2=pd.DataFrame(obj2)
print(df2)

  student_id  stat_core
0         s1         65
1         s2         99
2         s3         87
3         s4         75

In [8]:
# 데이터프레임객체.merge()
# 두 데이터프레임 병합

# case1.병합유형(how): inner(default)
# 두 데이터프레임의 공통 학생들의 점수만 합쳐짐
df1.merge(df2,on='student_id')

  student_id  stat_core_x  stat_core_y
0         s3           85           87
1         s4           71           75

In [9]:
# case2. 병합유형(how) : outer
# 두 데이터프레임의 모든 학생들의 점수가 합쳐짐
# 점수가 없는 과목은 NaN을 반환
# 학생 순서를 왼쪽 데이터프레임(df1)에 있는 student_id먼저 나옴
df1.merge(df2,how='outer',on='student_id')

  student_id  stat_core_x  stat_core_y
0         s3         85.0         87.0
1         s4         71.0         75.0
2         s5         63.0          NaN
3         s6         99.0          NaN
4         s1          NaN         65.0
5         s2          NaN         99.0

In [10]:
# case3. 병합유형(how) :left
# 왼쪽 데이터프레임(df1)에 있는 학생들의 점수들만 반환
# 점수가 없는 과목은 NaN 반환
df1.merge(df2,how='left',on='student_id')

  student_id  stat_core_x  stat_core_y
0         s3           85         87.0
1         s4           71         75.0
2         s5           63          NaN
3         s6           99          NaN

In [11]:
# case4. 병합유형(how) : right
# 오른쪽 데이터프레임(df1)에 있는 학생들의 점수들만 반환
# 점수가 없는 과목은 NaN 반환
df1.merge(df2,how='right',on='student_id')

  student_id  stat_core_x  stat_core_y
0         s1          NaN           65
1         s2          NaN           99
2         s3         85.0           87
3         s4         71.0           75

## 2절 데이터 요약

In [12]:
# 데이터프레임 생성
obj={'student_id':['s1','s2','s3','s4','s5','s6'],
     'stat_score':[55,90,85,71,63,99],
     'math_score':[65,99,87,75,57,88],
     'sex':['Female','Male','Female','Female','Male','Male'],
     'pre_level':['B','A','B','B','C','A']
     }
df=pd.DataFrame(obj)
print(df)

  student_id  stat_score  math_score     sex pre_level
0         s1          55          65  Female         B
1         s2          90          99    Male         A
2         s3          85          87  Female         B
3         s4          71          75  Female         B
4         s5          63          57    Male         C
5         s6          99          88    Male         A

In [14]:
# 그룹화 한후 데이터프레임 메소드 mean()을 통해 그룹화 평균 계산 가능
df.groupby('sex').mean(numeric_only=True)

        stat_score  math_score
sex
Female   70.333333   75.666667
Male     84.000000   81.333333

In [17]:
# 옵션 as_index=False
# 행 인덱스로 행 위치 인덱스 번호를 사용함
df.groupby('sex',as_index=False).mean(numeric_only=True)

      sex  stat_score  math_score
0  Female   70.333333   75.666667
1    Male   84.000000   81.333333

In [19]:
# 여러 열을 기준으로 그룹화하는 방법은 컬럼명을 담은 리스트를 사용
df.groupby(['sex','pre_level'],as_index=False).mean(numeric_only=True)

      sex pre_level  stat_score  math_score
0  Female         B   70.333333   75.666667
1    Male         A   94.500000   93.500000
2    Male         C   63.000000   57.000000

In [20]:
# describe() 메소드는 여러 종류의 특정한 통계량들을 제공
df.groupby('sex',as_index=False).describe()

      sex stat_score                                                      \
               count       mean        std   min   25%   50%   75%   max
0  Female        3.0  70.333333  15.011107  55.0  63.0  71.0  78.0  85.0
1    Male        3.0  84.000000  18.734994  63.0  76.5  90.0  94.5  99.0

  math_score
       count       mean        std   min   25%   50%   75%   max
0        3.0  75.666667  11.015141  65.0  70.0  75.0  81.0  87.0
1        3.0  81.333333  21.779195  57.0  72.5  88.0  93.5  99.0